namespace stackandkucha
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Я понял кучу и стек

            int a = 2; // Это локальное переменное оно и его данные храниться в стеке

            int[] b = new int[] { 1, 2, 3 }; // Это массив
            // Массив ссылочный тип в этом случае
            // b это ссылка на сам массив b оно храниться в стеке
            // а { 1, 2, 3 } оно уже храниться в куче мы через b можем обрашаться к ней
        }
    }
}